console.log('Homework 6.1');

/*
1) Написать функцию вывода одномерного массива `outArray(A, separator);`  в документ.
outArray([2,3,23,2,3], '**********************************' );
Разделитель необходимо вывести после всего массива.

2) Написать функцию заполнения случайными значениями одномерного массива с указанием длины. Диапазон - на свой вкус
`fillArray(A, 20);`
*/

// 1----------------------------------------------------
function outArray(A, separator) {
    document.write(A + ' ' + separator);
}

outArray([1,2,3,4,5,6,88,], '**********************');

// 2---------------------------------------------------
function fillArray(A, score) {
    for (var i=0; i<score; i++) {
        A.push(Math.floor(Math.random()*10));
    }
}

var A = [];

fillArray(A, 18);

console.log(A);